## Analise de dados das Olimpiadas

## Dataset https://www.kaggle.com/heesoo37/120-years-of-olympic-history-athletes-and-results

https://pandas.pydata.org/pandas-docs/stable/

In [2]:
import pandas as pd

In [5]:
dados ={'Nome':['Alice','Karina','Wesley','Enzo'],
        'Idade':[1,25,33,6],
        'Nota':[6.5,7.5,6.5,8.5]}



dataset = pd.DataFrame(dados)

In [6]:
dataset

     Nome  Idade  Nota
0   Alice      1   6.5
1  Karina     25   7.5
2  Wesley     33   6.5
3    Enzo      6   8.5

## adicionar uma coluna ao dataframe

In [7]:
dataset['Aprovado']=''

In [8]:
dataset

     Nome  Idade  Nota Aprovado
0   Alice      1   6.5
1  Karina     25   7.5
2  Wesley     33   6.5
3    Enzo      6   8.5

## Tamanho do dataframe

In [9]:
dataset.shape

(4, 4)

In [10]:
dataset.describe()

           Idade      Nota
count   4.000000  4.000000
mean   16.250000  7.250000
std    15.217862  0.957427
min     1.000000  6.500000
25%     4.750000  6.500000
50%    15.500000  7.000000
75%    27.000000  7.750000
max    33.000000  8.500000

In [26]:
dataset.Idade

0     1
1    25
2    33
3     6
Name: Idade, dtype: int64

In [11]:
type(dataset.Idade)

pandas.core.series.Series

## Renomeando colunas de um dataframe

In [12]:
data.rename(columns ={'Name':'Nome','Sex': 'Sexo','Age':'Idade','Height':'Altura','Weight':'Peso'})

NameError: name 'data' is not defined

## Localizando linhas

In [13]:
dataset.loc[0]

Nome        Alice
Idade           1
Nota          6.5
Aprovado
Name: 0, dtype: object

In [14]:
dataset.loc[0:2]

     Nome  Idade  Nota Aprovado
0   Alice      1   6.5
1  Karina     25   7.5
2  Wesley     33   6.5

## executando funções em uma coluna

In [16]:
dataset.Nota.mean()

7.25

## recuperar valores distintos

In [17]:
dataset.Nota.value_counts()

6.5    2
8.5    1
7.5    1
Name: Nota, dtype: int64

## Executando querys no dataset

In [36]:
dataset.loc[dataset['Nome'] =='Wesley']

     Nome  Idade  Notas Aprovado
2  Wesley     33    6.5

In [32]:
dataset.query('Idade > 1')

     Nome  Idade  Notas Aprovado
1  Karina     25    7.5
2  Wesley     33    6.5
3    Enzo      6    8.5